* load files
#+BEGIN_SRC emacs-lisp :tangle yes
      (find-file "~/Dropbox/emacs/config_thinkpad.org")
   (find-file "~/Dropbox/emacs/config.org")
    (setq-default fill-column 90)
    
     (set-face-attribute 'default nil :family "Fantasque sans mono" :height 180 :weight 'normal  :foreground "#ebdcb2")
    
#+END_SRC  

#+RESULTS:

If a variable is buffer-local, then setq sets its local value in the current buffer and setq-default sets the global default value.

If a variable is not buffer-local, then setq and setq-default do the same thing.


#+RESULTS:
: 90


#+begin_src emacs-lisp :tangle yes
  (setq-default line-spacing -0.75)
#+end_src

#+RESULTS:
: -0.75

* vertico height issue
#+begin_src emacs-lisp :tangle yes
    (advice-add 'vertico--setup :before (lambda () (setq vertico-count 15)))
(define-key minibuffer-local-map (kbd "s-'") (lambda ()
  (interactive)
  (let ((vertico-resize t))
    (setq vertico-count (if (= vertico-count 15) (- (frame-height) 5) 15))
    (vertico--exhibit))))

#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (let ((vertico-resize t)) (setq vertico-count (if (= vertico-count 15) (- (frame-height) 5) 15)) (vertico--exhibit)) |

